import operator, pylab, random
import matplotlib.pyplot as plt

# #Karate
# filename = 'Karate'
# N = 34
# y1 = [1 for i in range(N)]
# x = [i for i in range(N)]
# y2 = [1 for i in range(N)]
# for i in range(int(N*0.2)):
#     y2[i] -= 0.1
# y3 = [1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9]
#     #

# #Krebs
# filename = 'Krebs'
# N = 62
# y1 = [1 for i in range(N)]
# x = [i for i in range(N)]
# y2 = [1 for i in range(N)]
# for i in range(int(N*0.2)):
#     y2[i] -= 0.1
# y3 = [1, 1, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 0.9, 1, 0.9, 1, 1, 1]
#     #

# #Airport
# filename = 'Airport'
# N = 332
# y1 = [1 for i in range(N)]
# x = [i for i in range(N)]
# y2 = [1 for i in range(N)]
# for i in range(int(N*0.2)):
#     y2[i] -= 0.1
# y3 = [1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 0.9, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 0.9, 0.9, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 0.9, 1, 0.9, 0.9, 0.9, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 0.9, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 0.9]
#     #

#Crime
filename = 'Crime'
N = 829
y1 = [1 for i in range(N)]
x = [i for i in range(N)]
y2 = [1 for i in range(N)]
for i in range(int(N*0.2)):
    y2[i] -= 0.1
y3 = [1, 1, 1, 1, 1, 1, 1, 0.9, 1, 0.9, 1, 0.9, 1, 1, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 0.9, 0.9, 0.9, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 0.9, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 0.9, 0.9, 0.9, 0.9, 1, 0.9, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 0.9, 0.9, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 0.9, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 0.9, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 0.9, 1, 0.9, 1, 0.9, 0.9, 0.9, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 0.9, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 0.9, 1, 1, 1, 1, 1, 1, 1, 1, 0.9, 1, 1, 1, 0.9, 0.9, 1, 0.9, 1, 1, 1, 1]
    #



plt.rcParams.update({'font.size': 18, 'font.family': 'Times New Roman', 'mathtext.fontset': 'stix'})
plt.rcParams['figure.dpi'] = 500
TickSize = 11
LabelSize = 18
Labelpad = 5
LegendSize = 14
# Linewidth = 4

fig, ax = plt.subplots()

ax.plot(x, y1, color='r', linestyle=':', alpha=1, linewidth=3, ms=2, label='Case 1')
ax.plot(x, y2, color='b', linestyle='--',  alpha=1, linewidth=2, ms=0.5, label='Case 2')
ax.plot(x, y3, color='g', linestyle='-',  alpha=1, linewidth=0.6, ms=0.5,label='Case 3')
ax.set_ylabel('Attack success rate', labelpad=Labelpad, fontweight='bold', fontsize=LabelSize)
ax.set_xlabel('Node attack sequence', fontweight='bold', fontsize=LabelSize)
ax.set_title(filename, fontweight='bold', fontsize=LabelSize)
ax.set_ylim([0.89, 1.05])
ax.set_xlim(0,N+1)
# xmajorLocator = MultipleLocator(0.1)  # 将x主刻度标签设置为0.05的倍数
# xmajorFormatter = FormatStrFormatter('%.1f')  # 设置x轴标签文本的格式
# ax.xaxis.set_major_locator(xmajorLocator)
# ax.xaxis.set_major_formatter(xmajorFormatter)
#
# ymajorLocator = MultipleLocator(0.2)  # 将y轴主刻度标签设置为0.5的倍数
# ymajorFormatter = FormatStrFormatter('%.1f')  # 设置y轴标签文本的格式
# ax.yaxis.set_major_locator(ymajorLocator)
# ax.yaxis.set_major_formatter(ymajorFormatter)
# legend_properties = {'weight': 'bold'}
ax.legend(loc='upper right', fontsize=LegendSize)

ax.tick_params(axis='x', labelsize=TickSize)
ax.tick_params(axis='y', labelsize=TickSize)
fig.tight_layout()
plt.show()



# #画图
# # pylab.figure(figsize=(9,6), dpi=300)
# pylab.figure(dpi=400)
# # pylab.title(filename)
# pylab.title('Karate')
# pylab.xlabel(r"Node attack sequence")
# pylab.ylabel(r"Attack success rate")
# pylab.ylim(0.89,1.03)
# pylab.xlim(0,N+1)
# pylab.plot(x, y1, "r:", alpha=1, linewidth=3, ms=2)
# pylab.plot(x, y2, "b--", alpha=1, linewidth=2, ms=0.5)
# pylab.plot(x, y3, "g-", alpha=1, linewidth=0.6, ms=0.5)
#
# #画图时的标签
# pylab.legend((r"Case 1",
#                   "Case 2",
#               "Case 3",
#               ),
#                  loc = "upper right", shadow = False)
# pylab.show()
# pylab.close(1)